БИТУправление_медицинским_центром_демо/src/Catalogs/ДействующиеВеществаЛекарственныхПрепаратов/ДействующиеВеществаЛекарственныхПрепаратов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДействующиеВеществаЛекарственныхПрепаратов</name>
  <comment>1.2.643.5.1.13.13.11.1367</comment>
  <attributes>
    <name>НаименованиеНаЛатинском</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеНаАнглийском</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодАТХ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодSNOMEDCT</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Атрибуты</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Catalogs/ДействующиеВеществаЛекарственныхПрепаратов/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

#Область ЗагрузкаИзЕГИСЗ

// Возвращает идентификатор классификатора источника на сайте росминздрава.
// 
// Возвращаемое значение:
//   Строка.
//
Функция ПолучитьOIDСправочника() Экспорт
	Возврат "1.2.643.5.1.13.13.11.1367";
КонецФункции

// Возвращает список альтернативных идентификаторов классификатора источника на сайте росминздрава.
// 
// Возвращаемое значение:
// 	Массив Из Строка
//
Функция ПолучитьАльтернативныеOID() Экспорт
	СписокOID = Новый Массив();
	СписокOID.Добавить("1.2.643.5.1.13.2.1.1.644");
	Возврат СписокOID;
КонецФункции

// Описывает соответствие между именем реквизита в классификаторе и его именем в базе 1С.
// 
// Возвращаемое значение:
//   Соответствие.
//
Функция ПолучитьСопоставленийРеквизитовИXMLСправочникаЕГИСЗ() Экспорт
	
	Сопоставление = Новый Соответствие;
	
	//1) ID, Код, Целочисленное, уникальный идентификатор, целое число, обязательное поле, Обязательное;
	Сопоставление.Вставить("ID", "УИДЕГИСЗ");
	//2) NAME_RUS, Наименование на русском, Строковое, наименование действующего вещества на русском языке, необязательное поле, текстовый формат;
	Сопоставление.Вставить("NAME_RUS", "Наименование");
	//4) NAME_LAT, Наименование на латинском, Строковое, наименование действующего вещества на латинском языке, необязательное поле, текстовый формат;
	Сопоставление.Вставить("NAME_LAT", "НаименованиеНаЛатинском");
	//6) NAME_ENG, Наименование на английском, Строковое, наименование действующего вещества на английском языке, необязательное поле, текстовый формат;
	Сопоставление.Вставить("NAME_ENG", "НаименованиеНаАнглийском");
	//7) GROUP, Группа, Целочисленное, группа действующего вещества, обязательное поле, числовой формат:
	//	1 - Международные непатентованные наименования
	//	2 - Химические и общепринятые наименования
	//	3 - Биологические лекарственные препараты
	//	4 - Средства растительного происхождения
	//	5 - Модифицированные международные непатентованные и модифицированные группировочные наименования, Обязательное;
	Сопоставление.Вставить("GROUP", "Группа");
	//8) INN_RF, МНН в РФ, Целочисленное, МНН, используемые в лекарственных препаратах, разрешенных на территории РФ, отмечены цифрой 1, необязательное поле, числовой формат;
	Сопоставление.Вставить("INN_RF", "");
	//9) ATC, Код АТХ, Строковое, код анатомо-терапевтическо-химической классификации, необязательное поле, текстовый формат;
	Сопоставление.Вставить("ATC", "КодАТХ");
	//10) SCTID, Код SNOMED CT, Строковое, код международной номенклатуры медицинских терминов SNOMED CT, необязательное поле, текстовый формат;
	Сопоставление.Вставить("SCTID", "КодSNOMEDCT");
	
	Возврат Сопоставление;
	
КонецФункции

// Дополнительные атрибуты классификатора для загрузки.
// 
// Возвращаемое значение:
//  Соответствие - дополнительные атрибуты.
//
Функция ПолучитьДополнительныеАтрибуты() Экспорт
	
	Поля = Новый Соответствие;
	
	//3) NAME_ALTERNATIVE, Альтернативное наименование, Строковое, наименование действующего вещества на русском языке альтернативное наименованию действующего вещества на русском языке, необязательное поле, текстовый формат;
	Поля.Вставить("NAME_ALTERNATIVE", "NAME_ALTERNATIVE");
	//5) NAME_LAT_GENETIVUS, Наименование на латинском в родительном падеже, Строковое;
	Поля.Вставить("NAME_LAT_GENETIVUS", "NAME_LAT_GENETIVUS");
	
	Возврат Поля;
	
КонецФункции

// Формирует массив структур, ключи которых - поля для поиска существующих элементов при загрузки из ФР НСИ ЕГИСЗ,
//  а порядок в массиве - приоритет использования способов поиска.
// 
// Возвращаемое значение:
//  Массив - наборы ключей поиска.
//
Функция ПолучитьПорядокПоискаСуществующихОбъектов() Экспорт
	
	ПорядокПоиска = Новый Массив;
	
	ПоляПоиска = Новый Структура;
	ПоляПоиска.Вставить("УИДЕГИСЗ", "УИДЕГИСЗ");
	ПорядокПоиска.Добавить(ПоляПоиска);
	
	ПоляПоиска = Новый Структура;
	ПоляПоиска.Вставить("Наименование", "Наименование");
	ПорядокПоиска.Добавить(ПоляПоиска);
	
	Возврат ПорядокПоиска;
	
КонецФункции

// Возвращает массив структур, ключ которой - имя реквизита справочника, 
//	а значение - имя поля таблицы актуальных в общей форме загрузки.
// 
// Возвращаемое значение:
//   Массив.
//
Функция ПолучитьЗагружаемыеПоляЕГИСЗ() Экспорт
	
	Поля = Новый Структура;
	
	Поля.Вставить("УИДЕГИСЗ",	"УИДЕГИСЗ");
	Поля.Вставить("Наименование", "Наименование");
	Поля.Вставить("НаименованиеНаЛатинском", "НаименованиеНаЛатинском");
	Поля.Вставить("НаименованиеНаАнглийском", "НаименованиеНаАнглийском");
	Поля.Вставить("КодАТХ", "КодАТХ");
	Поля.Вставить("КодSNOMEDCT", "КодSNOMEDCT");
	Поля.Вставить("Группа", "Группа");
	
	Возврат Поля;
	
КонецФункции

#КонецОбласти

// Наименования кодов группы вещества.
// 
// Возвращаемое значение:
//  Соответствие - соответствие расшифровок кода группы.
//
Функция ПолучитьСоответствиеРасшифровокКодаГруппы() Экспорт
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить(1, "Международные непатентованные наименования");
	Соответствие.Вставить(2, "Химические и общепринятые наименования");
	Соответствие.Вставить(3, "Биологические лекарственные препараты");
	Соответствие.Вставить(4, "Средства растительного происхождения");
	Соответствие.Вставить(5, "Модифицированные международные непатентованные и модифицированные группировочные наименования");
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти
